#!/usr/bin/env bash
#
# managers/pacman.sh
#

################################################################################
# Проверка существования пакета
################################################################################

pkg_exists_pacman() {

    local package="$1"

    pacman -Si "$package" &>/dev/null
}

################################################################################
# Установка пакетов
################################################################################

install_pacman() {

    (($# == 0)) && return 0

    sudo pacman \
        -S \
        --needed \
        --noconfirm \
        "$@"
}